tutorials/stefanProblem/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions.
. $WM_PROJECT_DIR/bin/tools/CleanFunctions  # Tutorial clean functions


interfaceMethods="
isoAdvector
MULES
"

MAXX="50 100"


        
        for XM in $MAXX
            do
                echo "Setting grid number in X direction to $XM"
                sed "s/XM/$XM/g" system/blockMeshDict.template \
                > system/blockMeshDict
                
                for method in $interfaceMethods
                    do

                        echo "Setting interface tracking method to $method"

                        sed -e "s/INTERFACE_METHOD/$method/g" \
                        system/fvSolution.template \
                        > system/fvSolution

                        restore0Dir
                        runApplication blockMesh
                        runApplication setFields
                        runApplication $(getApplication)
                        
                        


                        methodDir="$method$XM"
                        mkdir "$method$XM"
                        mv -f log.* *.dat postProcessing "$method$XM"
                        cleanCase0
                        done
            done



#------------------------------------------------------------------------------
